<!DOCTYPE html>


<!--
 | Generated by Apache Maven Doxia Site Renderer 2.0.0-M13 from target/site-src/ko/markdown/index.md at 05 4월 2024
 | Rendered using Apache Maven Fluido Skin 2.0.0-M8
-->
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 2.0.0-M13" />
    <title>mybatis-spring</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-2.0.0-M8.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script src="./js/apache-maven-fluido-2.0.0-M8.min.js"></script>
  </head>
  <body>
    <div class="container-fluid container-fluid-top">
      <header>
        <div id="banner">
          <div class="pull-left"></div>
          <div class="pull-right"><div id="bannerRight"><h1><a href="https://blog.mybatis.org/" class="externalLink"><img class="imageLink" src="https://www.mybatis.org/images/mybatis-logo.png" alt="MyBatis logo" /> MyBatis</a></h1></div></div>
          <div class="clear"><hr/></div>
        </div>

        <div id="breadcrumbs">
          <ul class="breadcrumb">
        <li id="publishDate">Last Published: 20 11월 2023<span class="divider">|</span>
</li>
          <li id="projectVersion">Version: 3.0.3</li>
          </ul>
        </div>
      </header>
      <div class="row-fluid">
        <header id="leftColumn" class="span2">
          <nav class="well sidebar-nav">
  <ul class="nav nav-list">
   <li class="nav-header">참조 문서</li>
    <li class="active"><a>소개</a></li>
    <li><a href="getting-started.html">시작하기</a></li>
    <li><a href="factorybean.html">SqlSessionFactoryBean</a></li>
    <li><a href="transactions.html"><span class="icon-chevron-right"></span>트랜잭션</a></li>
    <li><a href="sqlsession.html"><span class="icon-chevron-right"></span>SqlSession 사용</a></li>
    <li><a href="mappers.html"><span class="icon-chevron-right"></span>매퍼 주입</a></li>
    <li><a href="boot.html">스프링 부트</a></li>
    <li><a href="using-api.html">마이바티스 API 사용</a></li>
    <li><a href="batch.html">스프링 배치</a></li>
    <li><a href="sample.html">샘플 코드</a></li>
   <li class="nav-header">프로젝트 문서화</li>
    <li><a href="project-info.html"><span class="icon-chevron-down"></span>프로젝트 정보</a>
     <ul class="nav nav-list">
      <li><a href="ci-management.html">연속통합 (Continuous Integration)</a></li>
      <li><a href="dependencies.html">의존물들 (Dependencies)</a></li>
      <li><a href="dependency-info.html">Dependency Information</a></li>
      <li><a href="distribution-management.html">Distribution Management</a></li>
      <li class="active"><a>정보</a></li>
      <li><a href="issue-management.html">이슈 추적</a></li>
      <li><a href="licenses.html">프로젝트 라이센스</a></li>
      <li><a href="mailing-lists.html">메일링 리스트</a></li>
      <li><a href="plugin-management.html">Plugin Management</a></li>
      <li><a href="plugins.html">Plugins</a></li>
      <li><a href="scm.html">소스 레파지토리</a></li>
      <li><a href="summary.html">프로젝트 요약</a></li>
      <li><a href="team.html">프로젝트 팀</a></li>
     </ul></li>
    <li><a href="project-reports.html"><span class="icon-chevron-right"></span>프로젝트 보고서</a></li>
  </ul>
          </nav>
          <div class="well sidebar-nav">
            <div id="poweredBy">
              <div class="clear"></div>
              <div class="clear"></div>
              <div class="clear"></div>
<a href="https://maven.apache.org/" class="builtBy" target="_blank"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </header>
        <main id="bodyColumn" class="span10">
<p></p><section>
<h1>&#xc18c;&#xac1c;</h1><section>
<h2>MyBatis-Spring &#xc740; &#xbb34;&#xc5c7;&#xc77c;&#xae4c;?</h2>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc740; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc640; &#xc2a4;&#xd504;&#xb9c1;&#xc744; &#xd3b8;&#xd558;&#xace0; &#xac04;&#xb2e8;&#xd558;&#xac8c; &#xc5f0;&#xb3d9;&#xd55c;&#xb2e4;. &#xc774; &#xbaa8;&#xb4c8;&#xc740; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb85c; &#xd558;&#xc5ec;&#xae08; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc5d0; &#xc27d;&#xac8c; &#xc5f0;&#xb3d9;&#xb418;&#xb3c4;&#xb85d; &#xcc98;&#xb9ac;&#xd55c;&#xb2e4;. &#xac8c;&#xb2e4;&#xac00; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xb9e4;&#xd37c;&#xc640; <code>SqlSession</code>&#xc744; &#xb2e4;&#xb8e8;&#xace0; &#xb2e4;&#xb978; &#xbe48;&#xc5d0; &#xc8fc;&#xc785;&#xc2dc;&#xcf1c;&#xc900;&#xb2e4;.
&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc608;&#xc678;&#xb97c; &#xc2a4;&#xd504;&#xb9c1;&#xc758; <code>DataAccessException</code>&#xb85c; &#xbcc0;&#xd658;&#xd558;&#xae30;&#xb3c4; &#xd558;&#xace0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;, &#xc2a4;&#xd504;&#xb9c1; &#xb610;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc5d0; &#xc758;&#xc874;&#xc131;&#xc744; &#xc5c6;&#xc560;&#xae30;&#xb3c4; &#xd55c;&#xb2e4;.</p></section><section>
<h2>&#xb3d9;&#xae30; &#xbd80;&#xc5ec;</h2>
<p>&#xc2a4;&#xd504;&#xb9c1; 2.x&#xc740; &#xc544;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; 2.x&#xb9cc;&#xc744; &#xc9c0;&#xc6d0;&#xd55c;&#xb2e4;. &#xc2a4;&#xd504;&#xb9c1; 3.x&#xc5d0;&#xc11c; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; 3.x&#xb97c; &#xc9c0;&#xc6d0;&#xd558;&#xae30; &#xc704;&#xd55c; &#xc2dc;&#xb3c4;&#xac00; &#xc9c4;&#xd589;&#xc911;&#xc774;&#xb2e4;. (&#xc2a4;&#xd504;&#xb9c1;&#xc758; &#xc774;&#xc288;&#xad00;&#xb9ac; &#xc2dc;&#xc2a4;&#xd15c;&#xc778; <a href="https://jira.springsource.org/browse/SPR-5991" class="externalLink">&#xc774;&#xc288;</a> &#xb97c; &#xbcf4;&#xb77c;.)
&#xbd88;&#xd589;&#xd558;&#xac8c;&#xb3c4; &#xc2a4;&#xd504;&#xb9c1; 3&#xc758; &#xac1c;&#xbc1c;&#xc774; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; 3.0&#xc758; &#xc815;&#xc2dd;&#xb9b4;&#xb9ac;&#xc988;&#xc804;&#xc5d0; &#xac1c;&#xbc1c;&#xc774; &#xc644;&#xb8cc;&#xb418;&#xc5c8;&#xb2e4;. &#xadf8;&#xb798;&#xc11c; &#xc2a4;&#xd504;&#xb9c1;&#xd300;&#xc740; &#xb9b4;&#xb9ac;&#xc988;&#xac00; &#xc548;&#xb41c; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xcf54;&#xb4dc;&#xb97c; &#xd568;&#xaed8; &#xb9b4;&#xb9ac;&#xc988;&#xd558;&#xb294; &#xac83;&#xc744; &#xc6d0;&#xd558;&#xc9c0; &#xc54a;&#xc558;&#xace0; &#xc2e4;&#xc81c;&#xc801;&#xc778; &#xc2a4;&#xd504;&#xb9c1; &#xc9c0;&#xc6d0;&#xc744; &#xae30;&#xb2e4;&#xb9b4;&#xc218;&#xbc16;&#xc5d0; &#xc5c6;&#xc5c8;&#xb2e4;.
&#xc2a4;&#xd504;&#xb9c1;&#xc758; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc9c0;&#xc6d0;&#xc5d0; &#xb300;&#xd55c; &#xad00;&#xc2ec;&#xc73c;&#xb85c; &#xc778;&#xd574;, &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xcee4;&#xbba4;&#xb2c8;&#xd2f0;&#xb294; &#xc7ac;&#xacb0;&#xd569;&#xd558;&#xb294; &#xd615;&#xd0dc;&#xb85c; &#xacb0;&#xc815;&#xc744; &#xb0b4;&#xace0; &#xb300;&#xc2e0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xd558;&#xc704; &#xd504;&#xb85c;&#xc81d;&#xd2b8; &#xd615;&#xd0dc;&#xb85c; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9; &#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xb97c; &#xcd94;&#xac00;&#xd55c;&#xb2e4;.</p></section><section>
<h2>&#xd544;&#xc694; &#xc870;&#xac74;</h2>
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xc744; &#xc2dc;&#xc791;&#xd558;&#xae30; &#xc804;&#xc5d0;, &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc640; &#xc2a4;&#xd504;&#xb9c1;&#xc758; &#xc6a9;&#xc5b4;&#xb97c; &#xb9de;&#xcd94;&#xb294; &#xc77c;&#xc774; &#xad49;&#xc7a5;&#xd788; &#xc911;&#xc694;&#xd588;&#xb2e4;. &#xc774; &#xbb38;&#xc11c;&#xb294; &#xbc30;&#xacbd;&#xc9c0;&#xc2dd;&#xc774;&#xb098; &#xae30;&#xbcf8;&#xc801;&#xc778; &#xc14b;&#xc5c5;&#xbc29;&#xbc95; &#xadf8;&#xb9ac;&#xace0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc640; &#xc2a4;&#xd504;&#xb9c1;&#xc758; &#xc124;&#xc815;&#xc5d0; &#xb300;&#xd55c; &#xd29c;&#xd1a0;&#xb9ac;&#xc5bc;&#xb4f1;&#xc740; &#xc81c;&#xacf5;&#xd558;&#xc9c0; &#xc54a;&#xb294;&#xb2e4;.</p>
<p>MyBatis-Spring requires following versions:</p>
<table class="table table-striped">
<thead>
<tr class="a">
<th>MyBatis-Spring</th>
<th>MyBatis</th>
<th>Spring Framework</th>
<th>Spring Batch</th>
<th>Java</th></tr></thead><tbody>
<tr class="b">
<td><strong>3.0</strong></td>
<td>3.5+</td>
<td>6.0+</td>
<td>5.0+</td>
<td>Java 17+</td></tr>
<tr class="a">
<td><strong>2.1</strong></td>
<td>3.5+</td>
<td>5.x</td>
<td>4.x</td>
<td>Java 8+</td></tr>
<tr class="b">
<td><del><strong>2.0</strong></del></td>
<td><del>3.5+</del></td>
<td><del>5.x</del></td>
<td><del>4.x</del></td>
<td><del>Java 8+</del></td></tr>
<tr class="a">
<td><del><strong>1.3</strong></del></td>
<td><del>3.4+</del></td>
<td><del>3.2.2+</del></td>
<td><del>2.1+</del></td>
<td><del>Java 6+</del></td></tr></tbody>
</table>
</section><section>
<h2>&#xac10;&#xc0ac; &#xc778;&#xc0ac;</h2>
<p>&#xc774; &#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xac00; &#xc2e4;&#xc81c;&#xb85c; &#xb9cc;&#xb4e4;&#xc5b4;&#xc9c0;&#xac8c; &#xb3c4;&#xc640;&#xc900; &#xbaa8;&#xb4e0; &#xd2b9;&#xbcc4;&#xd55c; &#xbd84;&#xb4e4;&#xc5d0;&#xac8c; &#xc815;&#xb9d0; &#xac10;&#xc0ac;&#xd55c;&#xb2e4;.
&#xc54c;&#xd30c;&#xbcb3; &#xc21c;&#xc11c;&#xb85c; &#xbcf4;&#xba74;, &#xcf54;&#xb529;&#xbc0f; &#xd14c;&#xc2a4;&#xd2b8; &#xadf8;&#xb9ac;&#xace0; &#xbb38;&#xc11c;&#xd654;&#xb97c; &#xb2f4;&#xb2f9;&#xd588;&#xb358; Eduardo Macarron, Hunter Presnall, Putthiphong Boonphong;
&#xadf8;&#xc678; &#xb2e4;&#xc591;&#xd55c; &#xd504;&#xb85c;&#xc81d;&#xd2b8; &#xae30;&#xc5ec;&#xc790;&#xc778; Andrius Juozapaitis, Giovanni Cuccu, Mike Lanyon, Raj Nagappan, Tomas Pinos;
&#xadf8;&#xb9ac;&#xace0; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc5d0; &#xd558;&#xc704; &#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xb85c; &#xac00;&#xc838;&#xc62c;&#xc218; &#xc788;&#xb3c4;&#xb85d; &#xb9ce;&#xc740; &#xac83;&#xc744; &#xcc3e;&#xc544;&#xc900; Simone Tripodi &#xc5d0;&#xac8c; &#xac10;&#xc0ac;&#xd55c;&#xb2e4;. ;)
&#xc774;&#xb4e4;&#xc774; &#xc5c6;&#xc5c8;&#xb2e4;&#xba74; &#xc774; &#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xb294; &#xc874;&#xc7ac;&#xd558;&#xc9c0; &#xc54a;&#xc558;&#xc744; &#xac83;&#xc774;&#xb2e4;.</p></section><section>
<h2>&#xc774; &#xbb38;&#xc11c;&#xac00; &#xb354; &#xb098;&#xc544;&#xc9c0;&#xb3c4;&#xb85d; &#xb3c4;&#xc640;&#xc8fc;&#xc138;&#xc694;&#x2026;</h2>
<p>&#xb9cc;&#xc57d;&#xc5d0; &#xc5b4;&#xb5a4; &#xbc29;&#xbc95;&#xc73c;&#xb85c;&#xb4e0; &#xc774; &#xbb38;&#xc11c;&#xc758; &#xcde8;&#xc57d;&#xc810;&#xc774; &#xbc1c;&#xacac;&#xb418;&#xac70;&#xb098; &#xae30;&#xb2a5;&#xc5d0; &#xb300;&#xd55c; &#xbb38;&#xc11c;&#xd654;&#xac00; &#xbe60;&#xc9c4; &#xbd80;&#xbd84;&#xc774; &#xbcf4;&#xc778;&#xb2e4;&#xba74;, &#xac00;&#xc7a5; &#xc88b;&#xc740; &#xbc29;&#xbc95;&#xc740; &#xba3c;&#xc800; &#xacf5;&#xbd80;&#xd574;&#xc11c; &#xc790;&#xc2e0;&#xb9cc;&#xc758; &#xbb38;&#xc11c;&#xb97c; &#xc791;&#xc131;&#xd558;&#xb294; &#xac83;&#xc774;&#xb2e4;.</p>
<p>&#xc774; &#xbb38;&#xc11c;&#xc758; &#xc6d0;&#xbcf8;&#xc740; markdown &#xd3ec;&#xb9f7;&#xc774;&#xba70; <a href="https://github.com/mybatis/spring/tree/master/src/site" class="externalLink">&#xd504;&#xb85c;&#xc81d;&#xd2b8;&#xc758; Git</a>&#xc5d0;&#xc11c; &#xcc3e;&#xc744; &#xc218; &#xc788;&#xb2e4;. repository &#xb97c; fork &#xd558;&#xace0;, &#xc5c5;&#xb370;&#xc774;&#xd2b8;&#xd558;&#xace0; pull request &#xb97c; &#xbcf4;&#xb0b4;&#xc8fc;&#xc2ed;&#xc2dc;&#xc624;.</p>
<p>&#xb2f9;&#xc2e0;&#xcc98;&#xb7fc; &#xc774; &#xbb38;&#xc11c;&#xb97c; &#xc77d;&#xb294; &#xc0ac;&#xb78c;&#xb4e4;&#xc5d0;&#xac8c; &#xc774; &#xbb38;&#xc11c;&#xc758; &#xcd5c;&#xace0;&#xc758; &#xc800;&#xc790;&#xac00; &#xb420;&#xc218; &#xc788;&#xb2e4;!</p></section><section>
<h2>&#xbc88;&#xc5ed;</h2>
<p>&#xc0ac;&#xc6a9;&#xc790;&#xb4e4;&#xc740; &#xb2e4;&#xc74c;&#xc758; &#xbc88;&#xc5ed;&#xbb38;&#xc11c;&#xbcc4;&#xb85c; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc5d0; &#xb300;&#xd574; &#xc54c;&#xc218; &#xc788;&#xb2e4;.</p>

<ul class="i18n">
  
<li class="en"><a href="./../index.html">English</a></li>
  
<li class="es"><a href="./../es/index.html">Espa&#xf1;ol</a></li>
  
<li class="zh"><a href="./../zh_CN/index.html">&#x7b80;&#x4f53;&#x4e2d;&#x6587;</a></li>
  
<li class="ja"><a href="./../ja/index.html">&#x65e5;&#x672c;&#x8a9e;</a></li>
  
<li class="ko"><a href="./getting-started.html">&#xd55c;&#xad6d;&#xc5b4;</a></li>
</ul>

<p>&#xc704; &#xbc88;&#xc5ed;&#xbb38;&#xc11c;&#xc5d0;&#xb294; &#xc5c6;&#xc9c0;&#xb9cc; &#xc790;&#xad6d;&#xc758; &#xc5b8;&#xc5b4;&#xb85c; &#xbb38;&#xc11c;&#xb85c; &#xbcf4;&#xace0; &#xc2f6;&#xb2e4;&#xba74;, &#xc790;&#xad6d;&#xc758; &#xc5b8;&#xc5b4;&#xb85c; &#xb41c; &#xbb38;&#xc11c;&#xb97c; &#xb9cc;&#xb4e4;&#xc5b4;&#xc11c; &#xc6b0;&#xb9ac;&#xc5d0;&#xac8c; &#xbcf4;&#xb0b4;&#xb2ec;&#xb77c;.</p></section></section>
        </main>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>©      2010–2024
<a href="https://www.mybatis.org/">MyBatis.org</a>
</p>
        </div>
      </div>
    </footer>
<script>
  if(anchors) {
    anchors.add();
  }
</script>
  </body>
</html>
