<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia Site Renderer 1.6 at 2016-03-29 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ko" lang="ko">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>mybatis-spring &#x2013; 마이바티스 스프링 연동모듈 | SqlSession 사용</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Hunter Presnall" />
      <meta name="author" content="Eduardo Macarron" />
      <meta name="author" content="이동국(한국어 번역)" />
    <meta name="Date-Revision-yyyymmdd" content="20160329" />
    <meta http-equiv="Content-Language" content="ko" />
        
        </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                mybatis-spring
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2016-03-29</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2.5</span>
                      </div>
            <div class="xright">        
                    
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
                    
                                <h5>레퍼런스 문서</h5>
                  <ul>
                  <li class="none">
                          <a href="index.html" title="소개">소개</a>
            </li>
                  <li class="none">
                          <a href="getting-started.html" title="시작하기">시작하기</a>
            </li>
                  <li class="none">
                          <a href="factorybean.html" title="SqlSessionFactoryBean">SqlSessionFactoryBean</a>
            </li>
                                                                                                        <li class="collapsed">
                          <a href="transactions.html" title="트랜잭션">트랜잭션</a>
                  </li>
                                                                                          <li class="expanded">
            <strong>SqlSession 사용</strong>
                  <ul>
                      <li class="none">
                          <a href="sqlsession.html#SqlSessionTemplate" title="SqlSessionTemplate">SqlSessionTemplate</a>
            </li>
                      <li class="none">
                          <a href="sqlsession.html#SqlSessionDaoSupport" title="SqlSessionDaoSupport">SqlSessionDaoSupport</a>
            </li>
              </ul>
        </li>
                                                                                      <li class="collapsed">
                          <a href="mappers.html" title="매퍼 주입">매퍼 주입</a>
                  </li>
                  <li class="none">
                          <a href="using-api.html" title="마이바티스 API 사용">마이바티스 API 사용</a>
            </li>
                  <li class="none">
                          <a href="batch.html" title="스프링 배치">스프링 배치</a>
            </li>
                  <li class="none">
                          <a href="sample.html" title="샘플코드">샘플코드</a>
            </li>
          </ul>
                       <h5>프로젝트 문서화</h5>
                  <ul>
                                                                                                                                                                                                                                                                          <li class="collapsed">
                          <a href="project-info.html" title="프로젝트 정보">프로젝트 정보</a>
                  </li>
                                                                                                                                                                                                                                                                                                              <li class="collapsed">
                          <a href="project-reports.html" title="프로젝트 보고서">프로젝트 보고서</a>
                  </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <!-- Copyright 2010-2012 the original author or authors.

  Licensed under the Apache License, Version 2.0 (the "License");
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License. --><!-- version: $Id$ -->

  
    <div class="section">
<h2><a name="Using_an_SqlSession"></a>Using an SqlSession</h2>
      
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc5d0;&#xc11c;&#xb294; <tt>SqlSession</tt>&#xb97c; &#xc0dd;&#xc131;&#xd558;&#xae30; &#xc704;&#xd574; <tt>SqlSessionFactory</tt>&#xb97c; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;. 
      &#xc138;&#xc158;&#xc744; &#xd55c;&#xbc88; &#xc0dd;&#xc131;&#xd558;&#xba74; &#xb9e4;&#xd551;&#xad6c;&#xbb38;&#xc744; &#xc2e4;&#xd589;&#xd558;&#xac70;&#xb098; &#xcee4;&#xbc0b; &#xb610;&#xb294; &#xb864;&#xbc31;&#xc744; &#xd558;&#xae30; &#xc704;&#xd574; &#xc138;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xc218; &#xc788;&#xb2e4;. 
      &#xb9c8;&#xc9c0;&#xb9c9;&#xc73c;&#xb85c; &#xb354; &#xc774;&#xc0c1; &#xd544;&#xc694;&#xd558;&#xc9c0; &#xc54a;&#xc740; &#xc0c1;&#xd0dc;&#xac00; &#xb418;&#xba74; &#xc138;&#xc158;&#xc744; &#xb2eb;&#xb294;&#xb2e4;. 
      &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xba74; <tt>SqlSessionFactory</tt>&#xb97c; &#xc9c1;&#xc811; &#xc0ac;&#xc6a9;&#xd560; &#xd544;&#xc694;&#xac00; &#xc5c6;&#xb2e4;.
      &#xc65c;&#xb0d0;&#xd558;&#xba74;, &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xc124;&#xc815;&#xc5d0; &#xb530;&#xb77c; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcee4;&#xbc0b; &#xd639;&#xc740; &#xb864;&#xbc31;&#xc744; &#xc218;&#xd589;&#xd558;&#xace0; &#xb2eb;&#xd600;&#xc9c0;&#xb294;, &#xc4f0;&#xb808;&#xb4dc;&#xc5d0; &#xc548;&#xc804;&#xd55c; <tt>SqlSession</tt> &#xac1c;&#xccb4;&#xac00; &#xc2a4;&#xd504;&#xb9c1; &#xbe48;&#xc5d0; &#xc8fc;&#xc785;&#xb420; &#xc218; &#xc788;&#xae30; &#xb54c;&#xbb38;&#xc774;&#xb2e4;.</p>

    
<div class="section">
<h3><a name="SqlSessionTemplate"></a>SqlSessionTemplate</h3>
      
<p><tt>SqlSessionTemplate</tt>&#xc740; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc758; &#xd575;&#xc2ec;&#xc774;&#xb2e4;. 
      <tt>SqlSessionTemplate</tt>&#xc740; <tt>SqlSession</tt>&#xc744; &#xad6c;&#xd604;&#xd558;&#xace0; &#xcf54;&#xb4dc;&#xc5d0;&#xc11c; <tt>SqlSession</tt>&#xb97c; &#xb300;&#xccb4;&#xd558;&#xb294; &#xc5ed;&#xd560;&#xc744; &#xd55c;&#xb2e4;. 
      <tt>SqlSessionTemplate</tt> &#xc740; &#xc4f0;&#xb808;&#xb4dc;&#xc5d0; &#xc548;&#xc804;&#xd558;&#xace0; &#xc5ec;&#xb7ec;&#xac1c;&#xc758; DAO&#xb098; &#xb9e4;&#xd37c;&#xc5d0;&#xc11c; &#xacf5;&#xc720;&#xd560;&#xc218; &#xc788;&#xb2e4;. </p>

      
<p><tt>getMapper()</tt>&#xc5d0; &#xc758;&#xd574; &#xb9ac;&#xd134;&#xb41c; &#xb9e4;&#xd37c;&#xac00; &#xac00;&#xc9c4; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd3ec;&#xd568;&#xd574;&#xc11c; SQL&#xc744; &#xcc98;&#xb9ac;&#xd558;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd560;&#xb54c;
      <tt>SqlSessionTemplate</tt>&#xc740; <tt>SqlSession</tt>&#xc774; &#xd604;&#xc7ac;&#xc758; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc5d0;&#xc11c; &#xc0ac;&#xc6a9;&#xb420;&#xc218; &#xc788;&#xb3c4;&#xb85d; &#xbcf4;&#xc7a5;&#xd55c;&#xb2e4;.
      &#xcd94;&#xac00;&#xc801;&#xc73c;&#xb85c; <tt>SqlSessionTemplate</tt>&#xc740; &#xd544;&#xc694;&#xd55c; &#xc2dc;&#xc810;&#xc5d0; &#xc138;&#xc158;&#xc744; &#xb2eb;&#xace0;, &#xcee4;&#xbc0b;&#xd558;&#xac70;&#xb098; &#xb864;&#xbc31;&#xd558;&#xb294; &#xac83;&#xc744; &#xd3ec;&#xd568;&#xd55c; &#xc138;&#xc158;&#xc758; &#xc0dd;&#xba85;&#xc8fc;&#xae30;&#xb97c; &#xad00;&#xb9ac;&#xd55c;&#xb2e4;.
      &#xb610;&#xd55c; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc608;&#xc678;&#xb97c; &#xc2a4;&#xd504;&#xb9c1;&#xc758; <tt>DataAccessException</tt>&#xb85c; &#xbcc0;&#xd658;&#xd558;&#xb294; &#xc791;&#xc5c5;&#xb610;&#xd55c; &#xcc98;&#xb9ac;&#xd55c;&#xb2e4;. </p>

      
<p><tt>SqlSessionTemplate</tt>&#xc740; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc758; &#xb514;&#xd3f4;&#xd2b8; &#xad6c;&#xd604;&#xccb4;&#xc778; <tt>DefaultSqlSession</tt> &#xb300;&#xc2e0; <b>&#xd56d;&#xc0c1;</b> &#xc0ac;&#xc6a9;&#xb41c;&#xb2e4;.
      &#xc65c;&#xb0d0;&#xd558;&#xba74; &#xd15c;&#xd50c;&#xb9bf;&#xc740; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc758; &#xc77c;&#xbd80;&#xcc98;&#xb7fc; &#xc0ac;&#xc6a9;&#xb420; &#xc218; &#xc788;&#xace0; &#xc5ec;&#xb7ec;&#xac1c; &#xc8fc;&#xc785;&#xb41c; &#xb9e4;&#xd37c; &#xd074;&#xb798;&#xc2a4;&#xc5d0; &#xc758;&#xd574; &#xc0ac;&#xc6a9;&#xb418;&#xb3c4;&#xb85d; &#xc4f0;&#xb808;&#xb4dc;&#xc5d0; &#xc548;&#xc804;&#xd558;&#xb2e4;.
      &#xb3d9;&#xc77c;&#xd55c; &#xc560;&#xd50c;&#xb9ac;&#xcf00;&#xc774;&#xc158;&#xc5d0;&#xc11c; &#xb450;&#xac1c;&#xc758; &#xd074;&#xb798;&#xc2a4;&#xac04;&#xc758; &#xc804;&#xd658;&#xc740; &#xb370;&#xc774;&#xd130; &#xbb34;&#xacb0;&#xc131; &#xc774;&#xc288;&#xb97c; &#xc57c;&#xae30;&#xd560;&#xc218; &#xc788;&#xb2e4;. </p>

      
<p><tt>SqlSessionTemplate</tt>&#xc740; &#xc0dd;&#xc131;&#xc790; &#xc778;&#xc790;&#xb85c; <tt>SqlSessionFactory</tt>&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; &#xc0dd;&#xc131;&#xb420; &#xc218; &#xc788;&#xb2e4;. </p>
        
<div class="source">
<pre>&lt;bean id=&quot;sqlSession&quot; class=&quot;org.mybatis.spring.SqlSessionTemplate&quot;&gt;
  &lt;constructor-arg index=&quot;0&quot; ref=&quot;sqlSessionFactory&quot; /&gt;
&lt;/bean&gt;</pre></div>        
     
      
<p>&#xc774; &#xbe48;&#xc740; DAO&#xbe48;&#xc5d0; &#xc9c1;&#xc811; &#xc8fc;&#xc785;&#xb420; &#xc218; &#xc788;&#xb2e4;. &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xbe48; &#xc124;&#xc815;&#xc5d0;&#xc11c; <tt>SqlSession</tt> &#xd504;&#xb85c;&#xd37c;&#xd2f0;&#xb97c; &#xc124;&#xc815;&#xd558;&#xba74; &#xb41c;&#xb2e4;. </p>
        
<div class="source">
<pre>public class UserDaoImpl implements UserDao {

  private SqlSession sqlSession;

  public void setSqlSession(SqlSession sqlSession) {
    this.sqlSession = sqlSession;
  }

  public User getUser(String userId) {
    return (User) sqlSession.selectOne(&quot;org.mybatis.spring.sample.mapper.UserMapper.getUser&quot;, userId);
  }
}</pre></div>
      
<p>&#xadf8;&#xb9ac;&#xace0; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; <tt>SqlSessionTemplate</tt> &#xb97c; &#xc8fc;&#xc785;&#xd558;&#xc790;. </p>      
      
<div class="source">
<pre>&lt;bean id=&quot;userDao&quot; class=&quot;org.mybatis.spring.sample.dao.UserDaoImpl&quot;&gt;
  &lt;property name=&quot;sqlSession&quot; ref=&quot;sqlSession&quot; /&gt;
&lt;/bean&gt;</pre></div>
      
      
<p><tt>SqlSessionTemplate</tt>&#xc740; &#xc778;&#xc790;&#xb85c; <tt>ExecutorType</tt>&#xb97c; &#xac00;&#xc9c0;&#xb294; &#xc0dd;&#xc131;&#xc790;&#xb97c; &#xac00;&#xc9c0;&#xace0; &#xc788;&#xb2e4;. 
      &#xc774; &#xc778;&#xc790;&#xb294; &#xc608;&#xb97c;&#xb4e4;&#xba74; &#xc2a4;&#xd504;&#xb9c1; &#xc124;&#xc815; XML&#xc744; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xc124;&#xc815;&#xd574;&#xc11c; &#xbc30;&#xce58;&#xd615;&#xd0dc;&#xc758; <tt>SqlSession</tt>&#xb97c; &#xb9cc;&#xb4e4;&#xc218;&#xb3c4; &#xc788;&#xb2e4;. </p>
        
<div class="source">
<pre>&lt;bean id=&quot;sqlSession&quot; class=&quot;org.mybatis.spring.SqlSessionTemplate&quot;&gt;
  &lt;constructor-arg index=&quot;0&quot; ref=&quot;sqlSessionFactory&quot; /&gt;
  &lt;constructor-arg index=&quot;1&quot; value=&quot;BATCH&quot; /&gt;
&lt;/bean&gt;</pre></div>
      
<p>DAO&#xc758; &#xcf54;&#xb4dc;&#xb97c; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xc791;&#xc131;&#xd588;&#xb2e4;&#xba74; &#xbaa8;&#xb4e0; &#xad6c;&#xbb38;&#xc740; &#xbc30;&#xce58;&#xd615;&#xd0dc;&#xb85c; &#xc2e4;&#xd589;&#xc774; &#xb420; &#xac83;&#xc774;&#xb2e4;. </p>
        
<div class="source">
<pre>public void insertUsers(User[] users) {
   for (User user : users) {
     sqlSession.insert(&quot;org.mybatis.spring.sample.mapper.UserMapper.insertUser&quot;, user);
   }
 }</pre></div> 
  
      
<p>&#xc774;&#xb7ec;&#xd55c; &#xc124;&#xc815;&#xd615;&#xd0dc;&#xb294; <tt>SqlSessionFactory</tt>&#xc758; &#xb514;&#xd3f4;&#xd2b8; &#xd615;&#xd0dc;&#xac00; &#xc544;&#xb2cc; &#xb2e4;&#xb978;&#xd615;&#xd0dc;&#xb85c; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xc2e4;&#xd589;&#xd574;&#xc57c; &#xd560;&#xb54c;&#xb9cc; &#xc0ac;&#xc6a9;&#xd560; &#xd544;&#xc694;&#xac00; &#xc788;&#xb2e4;. </p>

      
<p>&#xc774;&#xb7ec;&#xd55c; &#xd615;&#xd0dc;&#xc5d0; &#xb300;&#xd574; &#xad73;&#xc774; &#xacbd;&#xb85c;&#xb97c; &#xd558;&#xc790;&#xba74; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd560;&#xb54c; ExecutorType&#xc774; &#xb2e4;&#xb974;&#xba74; &#xc774;&#xbbf8; &#xc2dc;&#xc791;&#xb41c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xc9c0; <b>&#xbabb;&#xd560;</b>&#xac83;&#xc774;&#xb2e4;.      
       &#xb2e4;&#xb978; &#xc2e4;&#xd589;&#xc790;(executor) &#xd0c0;&#xc785;&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xb54c;&#xb294; <tt>SqlSessionTemplate</tt>&#xc758; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xad6c;&#xbd84;&#xb41c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;(PROPAGATION_REQUIRES_NEW&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xb294;)&#xc774;&#xb098; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xc678;&#xbd80;&#xc5d0;&#xc11c; &#xd638;&#xcd9c;&#xd558;&#xb294;&#xc9c0; &#xd655;&#xc2e4;&#xd788;&#xd574;&#xc57c; &#xd55c;&#xb2e4;. </p>
    </div>

    
<div class="section">
<h3><a name="SqlSessionDaoSupport"></a>SqlSessionDaoSupport</h3>
      
<p><tt>SqlSessionDaoSupport</tt>&#xb294; <tt>SqlSession</tt>&#xc744; &#xc81c;&#xacf5;&#xd558;&#xb294; &#xcd94;&#xc0c1;&#xd074;&#xb798;&#xc2a4;&#xc774;&#xb2e4;.
      <tt>getSqlSession()</tt>&#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd574;&#xc11c; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; SQL&#xc744; &#xcc98;&#xb9ac;&#xd558;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd558;&#xae30; &#xc704;&#xd574; &#xc0ac;&#xc6a9;&#xd560; <tt>SqlSessionTemplate</tt>&#xc744; &#xc5bb;&#xc744; &#xc218; &#xc788;&#xb2e4;. </p>
        
<div class="source">
<pre>public class UserDaoImpl extends SqlSessionDaoSupport implements UserDao {
  public User getUser(String userId) {
    return (User) getSqlSession().selectOne(&quot;org.mybatis.spring.sample.mapper.UserMapper.getUser&quot;, userId);
  }
}</pre></div>
      
<p>&#xb300;&#xac1c; <tt>MapperFactoryBean</tt>&#xc740; &#xcd94;&#xac00;&#xc801;&#xc778; &#xcf54;&#xb4dc;&#xac00; &#xd544;&#xc694;&#xc5c6;&#xae30; &#xb54c;&#xbb38;&#xc5d0; &#xc774; &#xd074;&#xb798;&#xc2a4;&#xb97c; &#xc120;&#xd638;&#xd55c;&#xb2e4;. 
      &#xd558;&#xc9c0;&#xb9cc; DAO&#xc5d0;&#xc11c; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xac00; &#xd544;&#xc694;&#xd558;&#xc9c0; &#xc54a;&#xace0; &#xad6c;&#xd604;&#xb41c; &#xd074;&#xb798;&#xc2a4;&#xac00; &#xd544;&#xc694;&#xd558;&#xc9c0; &#xc54a;&#xc744;&#xb54c;&#xb9cc; &#xc720;&#xc6a9;&#xd558;&#xb2e4;. </p>

      
<p><tt>SqlSessionDaoSupport</tt>&#xb294; <tt>sqlSessionFactory</tt> &#xc640; <tt>sqlSessionTemplate</tt> &#xd504;&#xb85c;&#xd37c;&#xd2f0;&#xb97c; &#xc14b;&#xd305;&#xd560; &#xd544;&#xc694;&#xac00; &#xc788;&#xb2e4;. 
      &#xb450;&#xac1c;&#xc758; &#xd504;&#xb85c;&#xd37c;&#xd2f0;&#xb97c; &#xbaa8;&#xb450; &#xc14b;&#xd305;&#xd558;&#xba74; <tt>sqlSessionFactory</tt>&#xb294; &#xbb34;&#xc2dc;&#xb41c;&#xb2e4;. </p>

      
<p><tt>SqlSessionDaoSupport</tt>&#xc758; &#xd558;&#xc704;&#xd074;&#xb798;&#xc2a4;&#xc778; <tt>UserDaoImpl</tt>&#xac00; &#xc788;&#xb2e4;&#xace0; &#xd558;&#xba74; &#xc2a4;&#xd504;&#xb9c1;&#xc5d0;&#xc11c;&#xb294; &#xb2e4;&#xc74c;&#xcc98;&#xb7fc; &#xc124;&#xc815;&#xb420; &#xc218; &#xc788;&#xb2e4;. </p>
        
<div class="source">
<pre>&lt;bean id=&quot;userMapper&quot; class=&quot;org.mybatis.spring.sample.mapper.UserDaoImpl&quot;&gt;
  &lt;property name=&quot;sqlSessionFactory&quot; ref=&quot;sqlSessionFactory&quot; /&gt;
&lt;/bean&gt;</pre></div>
      </div>
    </div>
  

      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                    2010&#x2013;2016
                        <a href="http://www.mybatis.org/">MyBatis.org</a>.
            All rights reserved.      
                    
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
