<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia Site Renderer 1.8.1 from src/site/ko/xdoc/transactions.xml at 01 4월 2019
 | Rendered using Apache Maven Fluido Skin 1.7
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ko" lang="ko">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Hunter Presnall" />
    <meta name="author" content="Eduardo Macarron" />
    <meta name="author" content="이동국(한국어 번역)" />
    <meta name="Date-Revision-yyyymmdd" content="20190401" />
    <meta http-equiv="Content-Language" content="ko" />
    <title>mybatis-spring &#x2013; 마이바티스 스프링 연동모듈 | 트랜잭션</title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.7.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />
    <script type="text/javascript" src="./js/apache-maven-fluido-1.7.min.js"></script>
  </head>
  <body class="topBarDisabled">
    <div class="container-fluid">
      <div id="banner">
        <div class="pull-left"><div id="bannerLeft"><h2>mybatis-spring</h2>
</div>
</div>
        <div class="pull-right"><a href="../../" id="bannerRight" title="MyBatis logo"><img src="../../images/mybatis-logo.png"  alt="MyBatis logo"/></a></div>
        <div class="clear"><hr/></div>
      </div>

      <div id="breadcrumbs">
        <ul class="breadcrumb">
        <li id="publishDate">Last Published: 01 4월 2019<span class="divider">|</span>
</li>
          <li id="projectVersion">Version: 2.0.0</li>
        </ul>
      </div>
      <div class="row-fluid">
        <div id="leftColumn" class="span2">
          <div class="well sidebar-nav">
    <ul class="nav nav-list">
      <li class="nav-header">참조 문서</li>
    <li><a href="index.html" title="소개"><span class="none"></span>소개</a></li>
    <li><a href="getting-started.html" title="시작하기"><span class="none"></span>시작하기</a></li>
    <li><a href="factorybean.html" title="SqlSessionFactoryBean"><span class="none"></span>SqlSessionFactoryBean</a></li>
    <li class="active"><a href="#"><span class="icon-chevron-down"></span>트랜잭션</a>
    <ul class="nav nav-list">
    <li><a href="transactions.html#configuration" title="표준 설정"><span class="none"></span>표준 설정</a></li>
    <li><a href="transactions.html#container" title="컨테이너 관리 트랜잭션"><span class="none"></span>컨테이너 관리 트랜잭션</a></li>
    <li><a href="transactions.html#programmatic" title="수동으로 트랜잭션 관리"><span class="none"></span>수동으로 트랜잭션 관리</a></li>
    </ul>
</li>
    <li><a href="sqlsession.html" title="SqlSession 사용"><span class="icon-chevron-right"></span>SqlSession 사용</a></li>
    <li><a href="mappers.html" title="매퍼 주입"><span class="icon-chevron-right"></span>매퍼 주입</a></li>
    <li><a href="boot.html" title="스프링 부트"><span class="none"></span>스프링 부트</a></li>
    <li><a href="using-api.html" title="마이바티스 API 사용"><span class="none"></span>마이바티스 API 사용</a></li>
    <li><a href="batch.html" title="스프링 배치"><span class="none"></span>스프링 배치</a></li>
    <li><a href="sample.html" title="샘플 코드"><span class="none"></span>샘플 코드</a></li>
      <li class="nav-header">프로젝트 문서화</li>
    <li><a href="project-info.html" title="프로젝트 정보"><span class="icon-chevron-right"></span>프로젝트 정보</a></li>
    <li><a href="project-reports.html" title="프로젝트 보고서"><span class="icon-chevron-right"></span>프로젝트 보고서</a></li>
</ul>
          <hr />
          <div id="poweredBy">
            <div class="clear"></div>
            <div class="clear"></div>
            <div class="clear"></div>
            <div class="clear"></div>
<a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy"><img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" /></a>
            </div>
          </div>
        </div>
        <div id="bodyColumn"  class="span10" >


  
    <div class="section">
<h2><a name="Transactions"></a>Transactions</h2>
      
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xc911;&#xc694;&#xd55c; &#xc774;&#xc720;&#xc911; &#xd558;&#xb098;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xac00; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc5d0; &#xc790;&#xc5f0;&#xc2a4;&#xb7fd;&#xac8c; &#xc5f0;&#xb3d9;&#xb420;&#xc218; &#xc788;&#xb2e4;&#xb294; &#xac83;&#xc774;&#xb2e4;. 
      &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xc5d0; &#xc885;&#xc18d;&#xb418;&#xb294; &#xc0c8;&#xb85c;&#xc6b4; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xb97c; &#xb9cc;&#xb4dc;&#xb294; &#xac83;&#xbcf4;&#xb2e4;&#xb294; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc774; &#xc2a4;&#xd504;&#xb9c1;&#xc758; <tt>DataSourceTransactionManager</tt>&#xacfc; &#xc735;&#xd569;&#xb418;&#xb294; &#xac83;&#xc774; &#xc88b;&#xb2e4;. </p>
      
<p>&#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xc790;&#xb97c; &#xd55c;&#xbc88; &#xc124;&#xc815;&#xd558;&#xba74;, &#xb300;&#xac1c;&#xc758; &#xacbd;&#xc6b0;&#xcc98;&#xb7fc; &#xc2a4;&#xd504;&#xb9c1;&#xc5d0;&#xc11c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc124;&#xc815;&#xd560; &#xc218; &#xc788;&#xb2e4;.
      <tt>@Transactional</tt> &#xc560;&#xb178;&#xd14c;&#xc774;&#xc158;&#xacfc; AOP&#xc2a4;&#xd0c0;&#xc77c;&#xc758; &#xc124;&#xc815; &#xbaa8;&#xb450; &#xc9c0;&#xc6d0;&#xd55c;&#xb2e4;.
      &#xd558;&#xb098;&#xc758; <tt>SqlSession</tt>&#xac1d;&#xccb4;&#xac00; &#xc0dd;&#xc131;&#xb418;&#xace0; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc774; &#xb3d9;&#xc791;&#xd558;&#xb294; &#xb3d9;&#xc548; &#xc9c0;&#xc18d;&#xc801;&#xc73c;&#xb85c; &#xc0ac;&#xc6a9;&#xb420;&#xac83;&#xc774;&#xb2e4;. 
      &#xc138;&#xc158;&#xc740; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc774; &#xc644;&#xb8cc;&#xb418;&#xba74; &#xc801;&#xc808;&#xd788; &#xcee4;&#xbc0b;&#xc774; &#xb418;&#xac70;&#xb098; &#xb864;&#xbc31;&#xb420;&#xac83;&#xc774;&#xb2e4;. </p>
      
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc740; &#xd55c;&#xbc88; &#xc14b;&#xc5c5;&#xb418;&#xba74; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xd22c;&#xba85;&#xd558;&#xac8c; &#xad00;&#xb9ac;&#xd55c;&#xb2e4;. 
      DAO&#xd074;&#xb798;&#xc2a4;&#xc5d0; &#xc5b4;&#xb5a0;&#xd55c; &#xcd94;&#xac00;&#xc801;&#xc778; &#xcf54;&#xb4dc;&#xb97c; &#xb123;&#xc744; &#xd544;&#xc694;&#xac00; &#xc5c6;&#xb2e4;. </p>
  
    <a name="configuration"></a>
<div class="section" id="configuration">
<h3><a name="a.ED.91.9C.EC.A4.80_.EC.84.A4.EC.A0.95"></a>&#xd45c;&#xc900; &#xc124;&#xc815;</h3>
      
<p>&#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xac00;&#xb2a5;&#xd558;&#xac8c; &#xd558;&#xb824;&#xba74;, &#xc2a4;&#xd504;&#xb9c1; &#xc124;&#xc815;&#xd30c;&#xc77c;&#xc5d0; <tt>DataSourceTransactionManager</tt>&#xb97c; &#xc0dd;&#xc131;&#xd558;&#xc790;. </p>
      
<div class="source"><pre class="prettyprint">
&lt;bean id=&quot;transactionManager&quot; class=&quot;org.springframework.jdbc.datasource.DataSourceTransactionManager&quot;&gt;
  &lt;constructor-arg ref=&quot;dataSource&quot; /&gt;
&lt;/bean&gt;</pre></div>

      
<div class="source"><pre class="prettyprint">
@Bean
public DataSourceTransactionManager transactionManager() {
  return new DataSourceTransactionManager(dataSource());
}</pre></div>

      
<p>&#xba85;&#xc2dc;&#xb41c; <tt>DataSource</tt>&#xb294; &#xc2a4;&#xd504;&#xb9c1;&#xc744; &#xc0ac;&#xc6a9;&#xd560;&#xb54c; &#xc77c;&#xbc18;&#xc801;&#xc73c;&#xb85c; &#xc0ac;&#xc6a9;&#xd55c;&#xb2e4;&#xba74; &#xc5b4;&#xb5a0;&#xd55c; JDBC <tt>DataSource</tt>&#xb3c4; &#xb420;&#xc218; &#xc788;&#xb2e4;.
       JNDI&#xb8e9;&#xc5c5;&#xc744; &#xd1b5;&#xd574; &#xc5bb;&#xc5b4;&#xc9c4; <tt>DataSource</tt>&#xbfd0; &#xc544;&#xb2c8;&#xb77c; &#xcee4;&#xb125;&#xc158; &#xd480;&#xb9c1; &#xae30;&#xb2a5;&#xb3c4; &#xd3ec;&#xd568;&#xd55c;&#xb2e4;. </p>
      
<p>&#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xc790;&#xc5d0; &#xba85;&#xc2dc;&#xb41c; <tt>DataSource</tt>&#xac00; <tt>SqlSessionFactoryBean</tt>&#xc744; &#xc0dd;&#xc131;&#xd560;&#xb54c; &#xc0ac;&#xc6a9;&#xb41c; &#xac83;&#xacfc; <b>&#xbc18;&#xb4dc;&#xc2dc;</b> &#xb3d9;&#xc77c;&#xd55c; &#xac83;&#xc774;&#xc5b4;&#xc57c; &#xd558;&#xb294; &#xac83;&#xb9cc; &#xaf2d; &#xae30;&#xc5b5;&#xd558;&#xc790;.
      &#xadf8;&#xb807;&#xc9c0; &#xc54a;&#xc73c;&#xba74; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xac00; &#xc81c;&#xb300;&#xb85c; &#xb418;&#xc9c0; &#xc54a;&#xc744;&#xac83;&#xc774;&#xb2e4;.  </p>
    </div>

    <a name="container"></a>
<div class="section" id="container">
<h3><a name="Container_Managed_Transactions"></a>Container Managed Transactions</h3>
      
<p>&#xb9cc;&#xc57d;&#xc5d0; JEE&#xcee8;&#xd14c;&#xc774;&#xb108;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xace0; &#xc2a4;&#xd504;&#xb9c1;&#xc744; &#xcee8;&#xd14c;&#xc774;&#xb108; &#xad00;&#xb9ac; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;(container managed transactions, CMT)&#xc5d0; &#xb450;&#xb824;&#xd55c;&#xb2e4;&#xba74;, 
      &#xc2a4;&#xd504;&#xb9c1;&#xc740; <tt>JtaTransactionManager</tt>&#xb098; &#xadf8; &#xd558;&#xc704; &#xd074;&#xb798;&#xc2a4;&#xb85c; &#xc124;&#xc815;&#xb418;&#xc5b4;&#xc57c; &#xd55c;&#xb2e4;. 
      &#xc774;&#xb7ec;&#xd55c; &#xc124;&#xc815;&#xc744; &#xac00;&#xc7a5; &#xc27d;&#xac8c; &#xd558;&#xb294; &#xbc29;&#xbc95;&#xc740; &#xc2a4;&#xd504;&#xb9c1;&#xc758; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xb124;&#xc784;&#xc2a4;&#xd398;&#xc774;&#xc2a4; or <tt>JtaTransactionManagerFactoryBean</tt> &#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xb294; &#xac83;&#xc774;&#xb2e4;. </p>

      
<div class="source"><pre class="prettyprint">&lt;tx:jta-transaction-manager /&gt;</pre></div>

      
<div class="source"><pre class="prettyprint">
@Bean
public JtaTransactionManager transactionManager() {
  return new JtaTransactionManagerFactoryBean().getObject();
}</pre></div>

      
<p>&#xc774; &#xc124;&#xc815;&#xc5d0;&#xc11c;, &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4;&#xb294; CMT&#xc640; &#xd568;&#xaed8; &#xc124;&#xc815;&#xb41c; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xb9ac;&#xc18c;&#xc2a4;&#xcc98;&#xb7fc; &#xb3d9;&#xc791;&#xd560; &#xac83;&#xc774;&#xb2e4;.
      &#xc2a4;&#xd504;&#xb9c1;&#xc740; &#xc774;&#xbbf8; &#xc124;&#xc815;&#xb41c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; <tt>SqlSession</tt>&#xc744; &#xc774;&#xbbf8; &#xb3d9;&#xc791;&#xc911;&#xc778; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc5d0; &#xb123;&#xc744; &#xac83;&#xc774;&#xb2e4;. 
      &#xc2dc;&#xc791;&#xb41c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc774; &#xc5c6;&#xace0; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc774; &#xd544;&#xc694;&#xd55c; &#xacbd;&#xc6b0;&#xb77c;&#xba74; &#xc2a4;&#xd504;&#xb9c1;&#xc740; &#xc0c8;&#xb85c;&#xc6b4; &#xcee8;&#xd14c;&#xc774;&#xb108; &#xad00;&#xb9ac; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc2dc;&#xc791;&#xd560; &#xac83;&#xc774;&#xb2e4;. </p>
      
<p>CMT&#xb294; &#xc0ac;&#xc6a9;&#xd558;&#xc9c0;&#xb9cc; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xb97c; &#xc6d0;&#xd558;&#xc9c0; <b>&#xc54a;&#xb294;&#xb2e4;&#xba74;</b> &#xc5b4;&#xb5a0;&#xd55c; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xad00;&#xb9ac;&#xc790;&#xb97c; &#xc124;&#xc815;&#xd574;&#xc11c;&#xb3c4; <b>&#xc548;&#xb418;&#xace0;</b> 
      &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; <tt>ManagedTransactionFactory</tt>&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xae30; &#xc704;&#xd574;  <tt>SqlSessionFactoryBean</tt>&#xb97c; &#xc124;&#xc815;<b>&#xd574;&#xc57c;&#xb9cc;</b> &#xd55c;&#xb2e4;. </p>
      
<div class="source"><pre class="prettyprint">&lt;bean id=&quot;sqlSessionFactory&quot; class=&quot;org.mybatis.spring.SqlSessionFactoryBean&quot;&gt;
  &lt;property name=&quot;dataSource&quot; ref=&quot;dataSource&quot; /&gt;
  &lt;property name=&quot;transactionFactory&quot;&gt;
    &lt;bean class=&quot;org.apache.ibatis.transaction.managed.ManagedTransactionFactory&quot; /&gt;
  &lt;/property&gt;  
&lt;/bean&gt;</pre></div>

      
<div class="source"><pre class="prettyprint">
@Bean
public SqlSessionFactory sqlSessionFactory() {
  SqlSessionFactoryBean factoryBean = new SqlSessionFactoryBean();
  factoryBean.setDataSource(dataSource());
  factoryBean.setTransactionFactory(new ManagedTransactionFactory());
  return factoryBean.getObject();
}</pre></div>

    </div>
  
    <a name="programmatic"></a>
<div class="section" id="programmatic">
<h3><a name="Programmatic_Transaction_Management"></a>Programmatic Transaction Management</h3>
      
<p>&#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; <tt>SqlSession</tt>&#xc740; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xc81c;&#xc5b4;&#xd558;&#xb294; &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xc81c;&#xacf5;&#xd55c;&#xb2e4;. 
      &#xd558;&#xc9c0;&#xb9cc; &#xb9c8;&#xc774;&#xbc14;&#xd2f0;&#xc2a4; &#xc2a4;&#xd504;&#xb9c1; &#xc5f0;&#xb3d9;&#xbaa8;&#xb4c8;&#xc740; &#xbe48;&#xc744; &#xc2a4;&#xd504;&#xb9c1;&#xc774; &#xad00;&#xb9ac;&#xd558;&#xb294; <tt>SqlSession</tt>&#xc774;&#xb098; &#xc2a4;&#xd504;&#xb9c1;&#xc774; &#xad00;&#xb9ac;&#xd558;&#xb294; &#xb9e4;&#xd37c;&#xc5d0; &#xc8fc;&#xc785;&#xd55c;&#xb2e4;. 
      &#xc774; &#xb9d0;&#xc740; &#xc2a4;&#xd504;&#xb9c1;&#xc774; <b>&#xd56d;&#xc0c1;</b> &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xad00;&#xb9ac;&#xd55c;&#xb2e4;&#xb294; &#xb73b;&#xc774;&#xb2e4;. </p>
      
<p>&#xc2a4;&#xd504;&#xb9c1;&#xc774; &#xad00;&#xb9ac;&#xd558;&#xb294; <tt>SqlSession</tt>&#xc5d0;&#xc11c;&#xb294; <tt>SqlSession.commit()</tt>, <tt>SqlSession.rollback()</tt>
        &#xb610;&#xb294; <tt>SqlSession.close()</tt> &#xba54;&#xc11c;&#xb4dc;&#xb97c; &#xd638;&#xcd9c;&#xd560;&#xc218;&#xac00; &#xc5c6;&#xb2e4;. 
        &#xadf8;&#xb7fc;&#xc5d0;&#xb3c4; &#xbd88;&#xad6c;&#xd558;&#xace0; &#xc774; &#xba54;&#xc11c;&#xb4dc;&#xb4e4;&#xc744; &#xc0ac;&#xc6a9;&#xd558;&#xba74; <tt>UnsupportedOperationException</tt> &#xc608;&#xc678;&#xac00; &#xbc1c;&#xc0dd;&#xd55c;&#xb2e4;. 
        &#xc774;&#xb7ec;&#xd55c; &#xba54;&#xc11c;&#xb4dc;&#xb294; &#xc8fc;&#xc785;&#xb41c; &#xb9e4;&#xd37c; &#xd074;&#xb798;&#xc2a4;&#xc5d0;&#xc11c;&#xb294; &#xc0ac;&#xc6a9;&#xd560; &#xc218; &#xc5c6;&#xb2e4;. </p>
      
<p>JDBC&#xc5f0;&#xacb0;&#xc758; &#xc790;&#xb3d9;&#xcee4;&#xbc0b; &#xc124;&#xc815;&#xc744; &#xc5b4;&#xb5bb;&#xac8c; &#xd558;&#xb354;&#xb77c;&#xb3c4; &#xc2a4;&#xd504;&#xb9c1; &#xd2b8;&#xb79c;&#xc7ad;&#xc158; &#xbc16;&#xc758; <tt>SqlSession</tt> &#xb370;&#xc774;&#xd130; &#xba54;&#xc11c;&#xb4dc;&#xb098; &#xb9e4;&#xd37c; &#xba54;&#xc11c;&#xb4dc;&#xc758; &#xc2e4;&#xd589;&#xc740; &#xc790;&#xb3d9;&#xc73c;&#xb85c; &#xcee4;&#xbc0b;&#xb41c;&#xb2e4;. </p>
      
<p>&#xd2b8;&#xb798;&#xc7ad;&#xc158;&#xc744; &#xc218;&#xb3d9;&#xc73c;&#xb85c; &#xc81c;&#xc5b4;&#xd558;&#xace0;&#xc790; &#xd55c;&#xb2e4;&#xba74; <a class="externalLink" href="https://docs.spring.io/spring/docs/current/spring-framework-reference/data-access.html#transaction-programmatic">the Spring reference document(Data Access -Programmatic transaction management-)</a> &#xc744; &#xcc38;&#xace0;&#xd558;&#xc790;.
      &#xb2e4;&#xc74c;&#xc758; &#xcf54;&#xb4dc;&#xb294; &#xc2a4;&#xd504;&#xb9c1; &#xb808;&#xd37c;&#xb7f0;&#xc2a4; &#xc5d0;&#xc11c; &#xc5b8;&#xae09;&#xb41c; &#xb0b4;&#xc6a9;&#xc73c;&#xb85c; <tt>PlatformTransactionManager</tt>&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xc11c; &#xc218;&#xb3d9;&#xc73c;&#xb85c; &#xd2b8;&#xb79c;&#xc7ad;&#xc158;&#xc744; &#xb2e4;&#xb8e8;&#xb294; &#xbc29;&#xbc95;&#xc744; &#xbcf4;&#xc5ec;&#xc900;&#xb2e4;.</p>

      
<div class="source"><pre class="prettyprint">
TransactionStatus txStatus =
    transactionManager.getTransaction(new DefaultTransactionDefinition());
try {
  userMapper.insertUser(user);
} catch (Exception e) {
  transactionManager.rollback(txStatus);
  throw e;
}
transactionManager.commit(txStatus);</pre></div>

      
<p>
        You can omit to call the <tt>commit</tt> and <tt>rollback</tt> method using the <tt>TransactionTemplate</tt>.
      </p>

      
<div class="source"><pre class="prettyprint">
TransactionTemplate transactionTemplate = new TransactionTemplate(transactionManager);
transactionTemplate.execute(txStatus -&gt; {
  userMapper.insertUser(user);
  return null;
});</pre></div>

      
<p>&#xc774; &#xcf54;&#xb4dc;&#xb294; &#xb9e4;&#xd37c;&#xb97c; &#xc0ac;&#xc6a9;&#xd558;&#xc9c0;&#xb9cc; <tt>SqlSession</tt>&#xb97c; &#xc0ac;&#xc6a9;&#xd574;&#xb3c4; &#xc798; &#xb3d9;&#xc791;&#xd55c;&#xb2e4;. </p>
      </div>
    </div>
  

        </div>
      </div>
    </div>
    <hr/>
    <footer>
      <div class="container-fluid">
        <div class="row-fluid">
            <p>Copyright &copy;2010&#x2013;2019
<a href="http://www.mybatis.org/">MyBatis.org</a>.
All rights reserved.</p>
        </div>
      </div>
    </footer>
  </body>
</html>
